app/controllers/users_controller.rb

INSERT INTO "users" ("single_access_token", "last_request_at", "created_at", "crypted_password", "perishable_token", "updated_at", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "full_name", "persistence_token", "login_count", "last_login_ip", "login", "last_login_at", "email") VALUES('p5pE3U-sgqhrVTfDVJYn', '2010-09-10 17:11:34', '2010-09-10 17:11:34', 'de277530b90f21e77dd228847e5c834ee32770310fb424017d702f9b2b86b717d15ae55f5cf973b2413253680e5ae5f995c5f29ef56c3940c3d4110fbe8a7542', '4pg6A44o24-oFAfnFD9m', '2010-09-10 17:11:34', 0, '127.0.0.1', 'FYJX3knt4-RGhjOKF-SF', '2010-09-10 17:11:34', NULL, 'f1034be9a93fde048f0b57968cbaabff008f84e7552c3c304187edaf31bd8f9a2da8044b280bfe4d8236074cfd5e7a869d076b6b7b6907c5dc0111f06a8ca810', 1, NULL, 'jorge', NULL, '1@1.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save